#include <stdio.h>

void main()
{
    int i,j;
    int a[][4] = {{1,2,3,4},{12,23,34,45},{1234,23456,34567,25}};

    int m[4] = {1,2,3,4};
    int n[4] = {12,23,34,45};
    int k[4] = {1234,23456,34567,25};
    int *b[] = {m,n,k};              //是一个数组，数组的元素是(int *)，指针数组

    int (*p)[4] = a;                 //是一个指针，指针指向一个数组，数组指针
    /* 这句可以写成：
    int (*p)[4];
    p = a;
    */

    for(i =0;i<3;i++){
        for(j = 0; j<4; j++){
            printf("%d ",*(*(p+i)+j));
        }
        printf("\r\n");
    }

    for(i =0;i<3;i++){
        for(j = 0; j<4; j++){
            printf("%d ",*(*(b+i)+j));
        }
        printf("\r\n");
    }
        
}